espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/ble5stack/boards/CC2652RB_LAUNCHXL/CC2652RB_LAUNCHXL.c
/*
 * Place the flash buffers in the .nvs section created in the gcc linker file.
 * The .nvs section enforces alignment on a sector boundary but may
 * be placed anywhere in flash memory.  If desired the .nvs section can be set
 * to a fixed address by changing the following in the gcc linker file:
 *
 * .nvs (FIXED_FLASH_ADDR) (NOLOAD) : AT (FIXED_FLASH_ADDR) {
 *      *(.nvs)
 * } > REGION_TEXT
 */
__attribute__ ((section (".nvs")))
static char flashBuf[REGIONSIZE];

#endif
#endif // NO_OSAL_SNV

/* Allocate objects for NVS Internal Regions */
NVSCC26XX_Object nvsCC26xxObjects[1];

// Customization: NO_OSAL_SNV removes NVS flash region
#if !defined(NO_OSAL_SNV)
/* Hardware attributes for NVS Internal Regions */
const NVSCC26XX_HWAttrs nvsCC26xxHWAttrs[1] = {
    {
        .regionBase = (void *)flashBuf,
        .regionSize = REGIONSIZE,
    },
};
#endif // NO_OSAL_SNV
#endif /* Board_EXCLUDE_NVS_INTERNAL_FLASH */

#ifndef Board_EXCLUDE_NVS_EXTERNAL_FLASH

#define SPISECTORSIZE    0x1000
#define SPIREGIONSIZE    0x100000     /* total storage size of external flash */
#define VERIFYBUFSIZE    64

// Customization: Only OAD needs SPI
#ifdef NVSSPI
static uint8_t verifyBuf[VERIFYBUFSIZE];
#endif // NVSSPI

/* Allocate objects for NVS External Regions */
#ifdef NVSSPI
NVSSPI25X_Object nvsSPI25XObjects[1];
#endif // NVSSPI



#ifdef NVSSPI
/* Hardware attributes for NVS External Regions */
const NVSSPI25X_HWAttrs nvsSPI25XHWAttrs[1] = {
    {
        .regionBaseOffset = 0,
        .regionSize = SPIREGIONSIZE,
        .sectorSize = SPISECTORSIZE,
        .verifyBuf = verifyBuf,
        .verifyBufSize = VERIFYBUFSIZE,
        .spiHandle = NULL,
        .spiIndex = 0,
        .spiBitRate = 4000000,
        .spiCsnGpioIndex = CC2652RB_LAUNCHXL_GPIO_SPI_FLASH_CS,
        .statusPollDelayUs = 100,
    },
};
#endif // NVSSPI

#endif /* Board_EXCLUDE_NVS_EXTERNAL_FLASH */

/* NVS Region index 0 and 1 refer to NVS and NVS SPI respectively */
// Customization: Empty NVS config array if not used
#if (defined(NO_OSAL_SNV) && !defined(NVSSPI) && !defined(USE_FPGA))
const NVS_Config NVS_config;
#else
const NVS_Config NVS_config[CC2652RB_LAUNCHXL_NVSCOUNT] = {
#if !defined(NO_OSAL_SNV)
#ifndef Board_EXCLUDE_NVS_INTERNAL_FLASH
    {
        .fxnTablePtr = &NVSCC26XX_fxnTable,
        .object = &nvsCC26xxObjects[0],
        .hwAttrs = &nvsCC26xxHWAttrs[0],
    },
#endif
#endif // NO_OSAL_SNV
#ifdef NVSSPI
#ifndef Board_EXCLUDE_NVS_EXTERNAL_FLASH
    {
        .fxnTablePtr = &NVSSPI25X_fxnTable,
        .object = &nvsSPI25XObjects[0],
        .hwAttrs = &nvsSPI25XHWAttrs[0],
    },
#endif
#endif // NVSSPI
};
#endif // NVS Config array

const uint_least8_t NVS_count = CC2652RB_LAUNCHXL_NVSCOUNT;

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {

    CC2652RB_LAUNCHXL_PIN_RLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,       /* LED initially off */
    CC2652RB_LAUNCHXL_PIN_GLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,       /* LED initially off */
    CC2652RB_LAUNCHXL_PIN_BTN1 | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,          /* Button is active low */
    CC2652RB_LAUNCHXL_PIN_BTN2 | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,          /* Button is active low */
    CC2652RB_LAUNCHXL_SPI_FLASH_CS | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MIN,  /* External flash chip select */
    CC2652RB_LAUNCHXL_UART0_RX | PIN_INPUT_EN | PIN_PULLDOWN,                                             /* UART RX via debugger back channel */
    CC2652RB_LAUNCHXL_UART0_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    CC2652RB_LAUNCHXL_SPI0_MOSI | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master out - slave in */
    CC2652RB_LAUNCHXL_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master in - slave out */
    CC2652RB_LAUNCHXL_SPI0_CLK | PIN_INPUT_EN | PIN_PULLDOWN,                                             /* SPI clock */

    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>

const PowerCC26X2_Config PowerCC26X2_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
#ifdef USE_RCOSC
    .calibrateRCOSC_LF  = true,
#else
    .calibrateRCOSC_LF  = false,
#endif
    .calibrateRCOSC_HF  = false,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWMCOUNT] = {
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN0, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER0A },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN1, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER0B },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN2, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER1A },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN3, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER1B },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN4, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER2A },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN5, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER2B },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN6, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER3A },
    { .pwmPin = CC2652RB_LAUNCHXL_PWMPIN7, .gpTimerUnit = CC2652RB_LAUNCHXL_GPTIMER3B },
};

const PWM_Config PWM_config[CC2652RB_LAUNCHXL_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM0], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM1], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM2], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM3], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM4], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM5], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM6], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2652RB_LAUNCHXL_PWM7], &pwmtimerCC26xxHWAttrs[CC2652RB_LAUNCHXL_PWM7] },
};

const uint_least8_t PWM_count = CC2652RB_LAUNCHXL_PWMCOUNT;

