espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/ble5stack/boards/CC2652RB_LAUNCHXL/CC2652RB_LAUNCHXL.c
/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,       /* Lowest HWI priority */
    .swiPriority        = 0,        /* Lowest SWI priority */
#ifdef USE_RCOSC
    .xoscHfAlwaysNeeded = false,    /* Keep XOSC dependency while in standby */
#else
    .xoscHfAlwaysNeeded = true,    /* Keep XOSC dependency while in standby */
#endif
    .globalCallback     = NULL,     /* No board specific callback */
    .globalEventMask    = 0         /* No events subscribed to */
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[CC2652RB_LAUNCHXL_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC2652RB_LAUNCHXL_SDCOUNT] = {
    {
        .spiIndex = CC2652RB_LAUNCHXL_SPI0,
        .spiCsGpioIndex = CC2652RB_LAUNCHXL_SDSPI_CS
    }
};

const SD_Config SD_config[CC2652RB_LAUNCHXL_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC2652RB_LAUNCHXL_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC2652RB_LAUNCHXL_SDSPI0]
    },
};

const uint_least8_t SD_count = CC2652RB_LAUNCHXL_SDCOUNT;

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26X2DMA.h>

SPICC26X2DMA_Object spiCC26X2DMAObjects[CC2652RB_LAUNCHXL_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26X2DMA_HWAttrs spiCC26X2DMAHWAttrs[CC2652RB_LAUNCHXL_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC2652RB_LAUNCHXL_SPI0_MOSI,
        .misoPin            = CC2652RB_LAUNCHXL_SPI0_MISO,
        .clkPin             = CC2652RB_LAUNCHXL_SPI0_CLK,
        .csnPin             = CC2652RB_LAUNCHXL_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC2652RB_LAUNCHXL_SPI1_MOSI,
        .misoPin            = CC2652RB_LAUNCHXL_SPI1_MISO,
        .clkPin             = CC2652RB_LAUNCHXL_SPI1_CLK,
        .csnPin             = CC2652RB_LAUNCHXL_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC2652RB_LAUNCHXL_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC2652RB_LAUNCHXL_SPI0],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC2652RB_LAUNCHXL_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC2652RB_LAUNCHXL_SPI1],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC2652RB_LAUNCHXL_SPI1]
    },
};

const uint_least8_t SPI_count = CC2652RB_LAUNCHXL_SPICOUNT;

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

UARTCC26XX_Object uartCC26XXObjects[CC2652RB_LAUNCHXL_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC2652RB_LAUNCHXL_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC2652RB_LAUNCHXL_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC2652RB_LAUNCHXL_UART0_TX,
        .rxPin          = CC2652RB_LAUNCHXL_UART0_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC2652RB_LAUNCHXL_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC2652RB_LAUNCHXL_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
    {
        .baseAddr       = UART1_BASE,
        .powerMngrId    = PowerCC26X2_PERIPH_UART1,
        .intNum         = INT_UART1_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC2652RB_LAUNCHXL_UART1_TX,
        .rxPin          = CC2652RB_LAUNCHXL_UART1_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC2652RB_LAUNCHXL_UART1],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC2652RB_LAUNCHXL_UART1]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    }
};

const UART_Config UART_config[CC2652RB_LAUNCHXL_UARTCOUNT] = {
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC2652RB_LAUNCHXL_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC2652RB_LAUNCHXL_UART0]
    },
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC2652RB_LAUNCHXL_UART1],
        .hwAttrs     = &uartCC26XXHWAttrs[CC2652RB_LAUNCHXL_UART1]
    },
};

const uint_least8_t UART_count = CC2652RB_LAUNCHXL_UARTCOUNT;

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC2652RB_LAUNCHXL_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC2652RB_LAUNCHXL_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC2652RB_LAUNCHXL_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC2652RB_LAUNCHXL_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC2652RB_LAUNCHXL_UDMA0]
    },
};



/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[CC2652RB_LAUNCHXL_WATCHDOGCOUNT];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[CC2652RB_LAUNCHXL_WATCHDOGCOUNT] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[CC2652RB_LAUNCHXL_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[CC2652RB_LAUNCHXL_WATCHDOG0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[CC2652RB_LAUNCHXL_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = CC2652RB_LAUNCHXL_WATCHDOGCOUNT;

/*
 *  Board-specific initialization function to disable external flash.
 *  This function is defined in the file CC2652RB_LAUNCHXL_fxns.c
 */
extern void Board_initHook(void);

/*
 *  ======== CC2652RB_LAUNCHXL_initGeneral ========
 */
void CC2652RB_LAUNCHXL_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        /* Error with PIN_init */
        while (1);
    }

    /* Perform board-specific initialization */
    Board_initHook();
}

/*
 *  ======== Board_init ========
 */
void Board_init(void)
{
    CC2652RB_LAUNCHXL_initGeneral();
}
